sources_org/aspect.org
;-*- mode: Org; fill-column: 110;-*-
* Aspect CTRM
** Persons
- Lance Fogtman (business)
- Nikita Levitskiy (head of product)
-
** history
2021
- *AWS* migration and ION Cloud management
- LNG advanced pricing and contract management
- *Crude and refined products* standard packages
- *UX* simplified reporting and workbenches
- *Operations* truck tickets support
2022
- *Carbon and emissions* commodity support
- *Metals* innovations and workflow support
- *UX* dashboards and usability improvements
- *Shipping* Softmar integration
- *Capital allocation* reporting
- *T/T+1* close of day
- *Risk analytics* FEA integration - risk metrics
2023
- *Ecosystem* data rich and connected solutions
- *UX* simplified trade, operations and back-office workflow
- *Market data* distribution platform and price discovery
- *Carbon* - use case diversity and ESG capture and reporting
- *Risk analytics* FEA integration - pricing models
- *STF* connectivity expansion - SGX, TT, LME
- *Trade finance* and capital allocation - continued
** TODO Ecosystems
Canonical model
- Prices
- Exposure
- PnL
- Positions
- AR/AP
- Accrual (начисления)

Others (already in):
- DSC
- Softmar
- Clarus
- Data lake
- ERP

in prograss:
- FEA - deep reisk analytics
- Lab specs
- Tanks
- Truck/rack
** Covering the full value chain of Liquefied Natural Gas
NG:
- Production
- NG Pipeline
NG-LNG
- Liquefaction
LNG
- LNG Storage
- Loading
- Shipping
- Discharge + LNG Storage + Reloads
LNG-NG
- Regasification
- Send out gas
- Consumption
- Storage

NG props:
- Production forecast tools
- Cargo loading program
- Liquefaction tolling
- model

LNG portfolio & cargo operations
- Physical optionality valuation including extrinsics
- Enhanced tools to manage boil off, heels, and bunker calcs
- Track performance including charters and freight hedges

Downstream
- Automated regasification process
- Model send out & stored gass
- Automate landed & tolling costs
** What is Aspect CTRM?
- 129$per user per month
- Commodity Trading Software and Risk Management
- http://www.aspectenterprise.com/
- https://iongroup.com
AspectCTRM is a Web, cloud-based SaaS software, which helps organizations across
 agriculture, oil and gas, bunker trading and various other sectors
 monitor multiple commodities, credit, market and operational
 risks.
** Features
Features include
- trade capture, -
- VaR reporting, - (Value-at-Risk) Reporting, estimates the potential
  loss of a portfolio over a specific time horizon with a given
  probability (usually 95% or 99%).
- pre-trade analytics - analyzing market data and other factors to
  predict the potential outcome of a trade before it is executed:
  Evaluate trade opportunities, Assess market risk, Optimize trade
  execution, Reduce trading costs.
- audit trail -  record of all changes in system
- group management - Assign permissions and access levels, performance
- energy corporations, OILspace, metals, Freight,

other
- Custom User Interfaces - dashboards, reports, and data visualizations
- RESTful APIs
- “Client-Side Scripting”
  - enhance user experience by enabling dynamic content updates,
  - form validations
  - interactive features without requiring full page reloads
- Event Handling and Custom Logic
  - automate workflows
  - trigger alerts
  - perform specific actions based on user interactions or data changes
- Modular Development - deploy reusable JavaScript components
- Third-Party Libraries - can connect jQuery, React, Angular - to enhance the functionality and user experience
- Testing and Debugging - some tools and environment
- Version Control and Collaboration - can integrate with Git. have it.
- Integration: Oracle Cloud Financials, JD Edwards EnterpriseOne, Microsoft Excel
** interface
- System menu :: Reports, Accounting, Brazil
  - Actions - workbanches to manipulate existing data: shipments, invoices
  - Create - create new master data: Deals, storages, etc..
  - tools - to create additional functionality
- Search
- User Tabs
- Node bar :: You are here: MP (Company) > Strategies
- landing page

** Objects and Root nodes
A record that characterise a document or an action.
- Classes: Deal, Cost, Invoice, Payment, Bank document, Bank transcation etc.
- Have inner state: initial and executed (completed, confirmed).
- Asigned to several hierarhcies.
- For every class exist a report.
*** Root nodes
- Trader
- Strategy - related group of deals
- Product - underlying commodity
- Location - related geographic region
- Couterparty - customer or company engaged
- Broker - groker engaged
- Company - Legal entitiy inside your company it is assigned to
- Book - “company department accoountable” - looks like a part of company

