aspect.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3472ea6">1. Aspect CTRM</a>
<ul>
<li><a href="#org303192b">1.1. Persons</a></li>
<li><a href="#org60ae0f1">1.2. history</a></li>
<li><a href="#org50df1a0">1.3. <span class="todo TODO">TODO</span> Ecosystems</a></li>
<li><a href="#orgd53483b">1.4. Covering the full value chain of Liquefied Natural Gas</a></li>
<li><a href="#org056f186">1.5. What is Aspect CTRM?</a></li>
<li><a href="#orgb8eaad4">1.6. Features</a></li>
<li><a href="#org08730a8">1.7. interface</a></li>
<li><a href="#orga518e23">1.8. Objects and Root nodes</a>
<ul>
<li><a href="#org3bb2fab">1.8.1. Root nodes</a></li>
</ul>
</li>
<li><a href="#orgb5e86e4">1.9. Risk</a></li>
</ul>
</li>
<li><a href="#org17dae3b">2. Commodity Trading</a>
<ul>
<li><a href="#org7259106">2.1. terms</a></li>
<li><a href="#org232101d">2.2. free books</a></li>
<li><a href="#org980ab21">2.3. theory</a>
<ul>
<li><a href="#org4cbc74c">2.3.1. differences:</a></li>
<li><a href="#orgc835252">2.3.2. Cash, Forward, futures, options</a></li>
<li><a href="#orga756935">2.3.3. other contracts</a></li>
<li><a href="#org7d04e46">2.3.4. <b>Hedging</b></a></li>
<li><a href="#orgd8e99f7">2.3.5. categories</a></li>
<li><a href="#org49748ac">2.3.6. open interest and Bull/Bear market</a></li>
</ul>
</li>
<li><a href="#org6018fa1">2.4. todo</a></li>
<li><a href="#org75d6a81">2.5. trading process</a></li>
<li><a href="#orge227493">2.6. clearing services</a>
<ul>
<li><a href="#org2260878">2.6.1. notable clearing services, electronic exchanges:</a></li>
</ul>
</li>
<li><a href="#org6c5bdd7">2.7. Resources</a></li>
<li><a href="#org0a532dd">2.8. Exchanges or Exchange Traded Commodities.</a></li>
<li><a href="#org319f563">2.9. INCOTERMS</a></li>
<li><a href="#org3873a46">2.10. courses</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
;-<b>- mode: Org; fill-column: 110;-</b>-
</p>
<div id="outline-container-org3472ea6" class="outline-2">
<h2 id="org3472ea6"><span class="section-number-2">1.</span> Aspect CTRM</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org303192b" class="outline-3">
<h3 id="org303192b"><span class="section-number-3">1.1.</span> Persons</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Lance Fogtman (business)</li>
<li>Nikita Levitskiy (head of product)</li>
<li></li>
</ul>
</div>
</div>
<div id="outline-container-org60ae0f1" class="outline-3">
<h3 id="org60ae0f1"><span class="section-number-3">1.2.</span> history</h3>
<div class="outline-text-3" id="text-1-2">
<p>
2021
</p>
<ul class="org-ul">
<li><b>AWS</b> migration and ION Cloud management</li>
<li>LNG advanced pricing and contract management</li>
<li><b>Crude and refined products</b> standard packages</li>
<li><b>UX</b> simplified reporting and workbenches</li>
<li><b>Operations</b> truck tickets support</li>
</ul>
<p>
2022
</p>
<ul class="org-ul">
<li><b>Carbon and emissions</b> commodity support</li>
<li><b>Metals</b> innovations and workflow support</li>
<li><b>UX</b> dashboards and usability improvements</li>
<li><b>Shipping</b> Softmar integration</li>
<li><b>Capital allocation</b> reporting</li>
<li><b>T/T+1</b> close of day</li>
<li><b>Risk analytics</b> FEA integration - risk metrics</li>
</ul>
<p>
2023
</p>
<ul class="org-ul">
<li><b>Ecosystem</b> data rich and connected solutions</li>
<li><b>UX</b> simplified trade, operations and back-office workflow</li>
<li><b>Market data</b> distribution platform and price discovery</li>
<li><b>Carbon</b> - use case diversity and ESG capture and reporting</li>
<li><b>Risk analytics</b> FEA integration - pricing models</li>
<li><b>STF</b> connectivity expansion - SGX, TT, LME</li>
<li><b>Trade finance</b> and capital allocation - continued</li>
</ul>
</div>
</div>
<div id="outline-container-org50df1a0" class="outline-3">
<h3 id="org50df1a0"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> Ecosystems</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Canonical model
</p>
<ul class="org-ul">
<li>Prices</li>
<li>Exposure</li>
<li>PnL</li>
<li>Positions</li>
<li>AR/AP</li>
<li>Accrual (начисления)</li>
</ul>

<p>
Others (already in):
</p>
<ul class="org-ul">
<li>DSC</li>
<li>Softmar</li>
<li>Clarus</li>
<li>Data lake</li>
<li>ERP</li>
</ul>

<p>
in prograss:
</p>
<ul class="org-ul">
<li>FEA - deep reisk analytics</li>
<li>Lab specs</li>
<li>Tanks</li>
<li>Truck/rack</li>
</ul>
</div>
</div>
<div id="outline-container-orgd53483b" class="outline-3">
<h3 id="orgd53483b"><span class="section-number-3">1.4.</span> Covering the full value chain of Liquefied Natural Gas</h3>
<div class="outline-text-3" id="text-1-4">
<p>
NG:
</p>
<ul class="org-ul">
<li>Production</li>
<li>NG Pipeline</li>
</ul>
<p>
NG-LNG
</p>
<ul class="org-ul">
<li>Liquefaction</li>
</ul>
<p>
LNG
</p>
<ul class="org-ul">
<li>LNG Storage</li>
<li>Loading</li>
<li>Shipping</li>
<li>Discharge + LNG Storage + Reloads</li>
</ul>
<p>
LNG-NG
</p>
<ul class="org-ul">
<li>Regasification</li>
<li>Send out gas</li>
<li>Consumption</li>
<li>Storage</li>
</ul>

<p>
NG props:
</p>
<ul class="org-ul">
<li>Production forecast tools</li>
<li>Cargo loading program</li>
<li>Liquefaction tolling</li>
<li>model</li>
</ul>

<p>
LNG portfolio &amp; cargo operations
</p>
<ul class="org-ul">
<li>Physical optionality valuation including extrinsics</li>
<li>Enhanced tools to manage boil off, heels, and bunker calcs</li>
<li>Track performance including charters and freight hedges</li>
</ul>

<p>
Downstream
</p>
<ul class="org-ul">
<li>Automated regasification process</li>
<li>Model send out &amp; stored gass</li>
<li>Automate landed &amp; tolling costs</li>
</ul>
</div>
</div>
<div id="outline-container-org056f186" class="outline-3">
<h3 id="org056f186"><span class="section-number-3">1.5.</span> What is Aspect CTRM?</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>129$per user per month</li>
<li>Commodity Trading Software and Risk Management</li>
<li><a href="http://www.aspectenterprise.com/">http://www.aspectenterprise.com/</a></li>
<li><a href="https://iongroup.com">https://iongroup.com</a></li>
</ul>
<p>
AspectCTRM is a Web, cloud-based SaaS software, which helps organizations across
 agriculture, oil and gas, bunker trading and various other sectors
 monitor multiple commodities, credit, market and operational
 risks.
</p>
</div>
</div>
<div id="outline-container-orgb8eaad4" class="outline-3">
<h3 id="orgb8eaad4"><span class="section-number-3">1.6.</span> Features</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Features include
</p>
<ul class="org-ul">
<li>trade capture, -</li>
<li>VaR reporting, - (Value-at-Risk) Reporting, estimates the potential
loss of a portfolio over a specific time horizon with a given
probability (usually 95% or 99%).</li>
<li>pre-trade analytics - analyzing market data and other factors to
predict the potential outcome of a trade before it is executed:
Evaluate trade opportunities, Assess market risk, Optimize trade
execution, Reduce trading costs.</li>
<li>audit trail -  record of all changes in system</li>
<li>group management - Assign permissions and access levels, performance</li>
<li>energy corporations, OILspace, metals, Freight,</li>
</ul>

<p>
other
</p>
<ul class="org-ul">
<li>Custom User Interfaces - dashboards, reports, and data visualizations</li>
<li>RESTful APIs</li>
<li>“Client-Side Scripting”
<ul class="org-ul">
<li>enhance user experience by enabling dynamic content updates,</li>
<li>form validations</li>
<li>interactive features without requiring full page reloads</li>
</ul></li>
<li>Event Handling and Custom Logic
<ul class="org-ul">
<li>automate workflows</li>
<li>trigger alerts</li>
<li>perform specific actions based on user interactions or data changes</li>
</ul></li>
<li>Modular Development - deploy reusable JavaScript components</li>
<li>Third-Party Libraries - can connect jQuery, React, Angular - to enhance the functionality and user experience</li>
<li>Testing and Debugging - some tools and environment</li>
<li>Version Control and Collaboration - can integrate with Git. have it.</li>
<li>Integration: Oracle Cloud Financials, JD Edwards EnterpriseOne, Microsoft Excel</li>
</ul>
</div>
</div>
<div id="outline-container-org08730a8" class="outline-3">
<h3 id="org08730a8"><span class="section-number-3">1.7.</span> interface</h3>
<div class="outline-text-3" id="text-1-7">
<dl class="org-dl">
<dt>System menu</dt><dd>Reports, Accounting, Brazil
<ul class="org-ul">
<li>Actions - workbanches to manipulate existing data: shipments, invoices</li>
<li>Create - create new master data: Deals, storages, etc..</li>
<li>tools - to create additional functionality</li>
</ul></dd>
<dt>(no term)</dt><dd>Search</dd>
<dt>(no term)</dt><dd>User Tabs</dd>
<dt>Node bar</dt><dd>You are here: MP (Company) &gt; Strategies</dd>
<dt>(no term)</dt><dd>landing page</dd>
</dl>
</div>
</div>

<div id="outline-container-orga518e23" class="outline-3">
<h3 id="orga518e23"><span class="section-number-3">1.8.</span> Objects and Root nodes</h3>
<div class="outline-text-3" id="text-1-8">
<p>
A record that characterise a document or an action.
</p>
<ul class="org-ul">
<li>Classes: Deal, Cost, Invoice, Payment, Bank document, Bank transcation etc.</li>
<li>Have inner state: initial and executed (completed, confirmed).</li>
<li>Asigned to several hierarhcies.</li>
<li>For every class exist a report.</li>
</ul>
</div>
<div id="outline-container-org3bb2fab" class="outline-4">
<h4 id="org3bb2fab"><span class="section-number-4">1.8.1.</span> Root nodes</h4>
<div class="outline-text-4" id="text-1-8-1">
<ul class="org-ul">
<li>Trader</li>
<li>Strategy - related group of deals</li>
<li>Product - underlying commodity</li>
<li>Location - related geographic region</li>
<li>Couterparty - customer or company engaged</li>
<li>Broker - groker engaged</li>
<li>Company - Legal entitiy inside your company it is assigned to</li>
<li>Book - “company department accoountable” - looks like a part of company</li>
</ul>
</div>
</div>
</div>
