sources_org/aspect.org
** Risk
VaR Value-at-Risk is a metric to assess the risk of your current portfolio.
- expected values of future events that may be +/-.
 CTRM Commodity Trading Software and Risk Management
(Commodity Trading and Risk Management) - commodity trading, risk
 management, and supply chain management.
- risks:  market risk, credit risk, and operational risk.
- Compliance with regulatory requirements.
- skils: commodity trading, risk management, supply chain management principles and practices.
* Commodity Trading
part of Financial markets
** terms
- Asset :: durable good. Anything that provides a current or potential future economic benefit to whoever
  possesses or controls that asset. Something of economic value that's owned or controlled by a person,
  company, or government.
- Liabilities :: something that is owed to another person, company, or government. ex: loans, tax obligations,
  and accounts payable.
- Commodity :: a type of asset.
- Market clearing :: process by which “demand” balace with “supply”, so neither a surplus nor a shortage.
- Clearing service (clearinghouse) :: intermediary between buyers and sellers in a commodity transaction.
  Process of settling trades, managing risk, and guaranteeing the performance of buyers and sellers in a
  commodity transaction. Types:
  - Exchange-based clearing: Provided by exchanges, such as the Chicago Mercantile Exchange (CME) or the
    Intercontinental Exchange (ICE), which offer clearing services for trades executed on their platforms.
  - Over-the-counter (OTC) clearing: Provided by third-party clearinghouses, such as the London Clearing House
    (LCH) or the Depository Trust & Clearing Corporation (DTCC), which clear trades executed outside of
    formal exchanges, directly with each other.
- Spot price :: cash price or current price -  for immediate (or short 1-2 days) delivery.
  - Delivery date :: Spot prices are for immediate delivery, while futures prices are for delivery at a
    specific future date.
  - Price risk :: Spot prices reflect current market conditions and are subject to immediate price risk, while
    futures prices are locked in at the time of the contract and are subject to price risk at the time of
    delivery.
  - Liquidity :: Spot markets are generally more liquid than futures markets, meaning it's easier to buy or
    sell assets at the current market price.
- Futures price :: a future date after delivery.
- Commodity price index :: index for some commodity, may be may be based on spot or futures prices.
- Commodity index fund :: fund whose assets are invested in financial instruments based on or linked to a
  commodity index.
- Cash commodity :: not derivatives, commodities that someone is buying/selling/trading.
- Derivatives :: evolved from simple commodity future contracts to many others.
- Exchage :: organized market
- Premises :: warehouse
- Metric tonne ::  weight of oil and other petroleum products. 1 = 1,000 kilograms or 2,204.62 pounds
- petroleum products :: нефтепродукты
- FOB :: Most oil is sold either FOB (effectively priced at the loading port) or CIF (effectively priced at
  the delivery port). Exclude all insurance and freight charges.
- MT :: metric tons is a lot size
- kgs :: kilograms
- bbl :: barrels
- Lots :: number of units of a financial unstrument traded in one transactions. Lot - size of transaction
- price quote :: катеровка цены, ценовое предложение, latest price. Quoted price is only valid for a certain
  period of time.
- Spread :: is defined as the difference between the current bid and ask prices
- contingencies :: непредвиденные обстоятельства
- Clearing Broker ::
- Executing Broker :: execute buy/sell orders on behalf of clients. They find the best prices in the market.
- Clearing Broker :: settlement of trades after they have been executed. Ensure that transaction is completed,
  includes transferring ownership of the securities and handling the associated cash flows.
- Financial statement :: formal records of fin. activities.
  - Consolided FS :: FS of a grpup in which the assets, liabilities, equality, income, expenses and cash flows
    of the parent company and it's subsidiaries are presented as of a single econimic entity. Type of report.
- revenue, income, profits :: something similar.
- income statement or profit and loss account :: one of financial statement of a company. Net income, result after all revenues and expenses have been accounted for.
- PnL :: day-over-day change in the value of a portfolio (value today - value prior day)
-

links
- https://imperiumcs.com/commodity-markets-glossary-terms/
- https://www.commoditiesdemystified.info/en/glossary
- https://www.unitedfutures.com/glossary.htm
** free books
The Basics of Commodities Trading

CME Commodity Trading Manual 2006 [[/home/ff/Downloads/ChickMan.pdf]] https://www.le.ac.uk/users/dsgp1/COURSES/DERIVATE/RESOURCE/ChickMan.pdf

Commodities trading: Commodities Trading 101: Lessons from Trading Books https://fastercapital.com/content/Commodities-trading--Commodities-Trading-101--Lessons-from-Trading-Books.html
** theory
*** differences:
- Elasitcity :: Electricity(low) vs Gold(high) - said: “elastic demand”. Refers to how responsive the demand for a
  commodity is to changes in its price. Commodities with low elasticity have a stable demand, regardless of
  price fluctuations, while those with high elasticity have a demand that can change significantly with price
  changes.
- Deliverability :: Natural gas (high) vs Lean hogs (low) - how ease and speed with which a commodity can be
  transported and delivered to various markets.
- Substitability :: Coffee (high) vs Gasoline (low) - can be replaced by other products or
  alternatives. Commodities with high substitutability have many alternatives, making demand more responsive
  to price changes, while those with low substitutability have limited alternatives, making demand less
  responsive.
- Storability :: Animals (low) vs Aluminum (high) - stored for extended periods without significant degradation or loss of
  value. Commodities with high storability can be kept in inventory for long periods, while those with low
  storability require immediate use or processing.
- Exchange Prices vs Local Prices :: Natural gas at Henry Hub (stable) vs Natural gas at source (local
  variable)
- Timing vs Production :: Winter wheat (low sensitive to weather) vs Spring wheat (high sensisitve) - seasonal
  patterns of a commodity, some commodities have specific timing requirements, such as planting and harvesting
  seasons, which can affect their yield and availability.

