aspect.html

<div id="outline-container-orgb5e86e4" class="outline-3">
<h3 id="orgb5e86e4"><span class="section-number-3">1.9.</span> Risk</h3>
<div class="outline-text-3" id="text-1-9">
<p>
VaR Value-at-Risk is a metric to assess the risk of your current portfolio.
</p>
<ul class="org-ul">
<li>expected values of future events that may be +/-.
CTRM Commodity Trading Software and Risk Management</li>
</ul>
<p>
(Commodity Trading and Risk Management) - commodity trading, risk
 management, and supply chain management.
</p>
<ul class="org-ul">
<li>risks:  market risk, credit risk, and operational risk.</li>
<li>Compliance with regulatory requirements.</li>
<li>skils: commodity trading, risk management, supply chain management principles and practices.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org17dae3b" class="outline-2">
<h2 id="org17dae3b"><span class="section-number-2">2.</span> Commodity Trading</h2>
<div class="outline-text-2" id="text-2">
<p>
part of Financial markets
</p>
</div>
<div id="outline-container-org7259106" class="outline-3">
<h3 id="org7259106"><span class="section-number-3">2.1.</span> terms</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt>Asset</dt><dd>durable good. Anything that provides a current or potential future economic benefit to whoever
possesses or controls that asset. Something of economic value that's owned or controlled by a person,
company, or government.</dd>
<dt>Liabilities</dt><dd>something that is owed to another person, company, or government. ex: loans, tax obligations,
and accounts payable.</dd>
<dt>Commodity</dt><dd>a type of asset.</dd>
<dt>Market clearing</dt><dd>process by which “demand” balace with “supply”, so neither a surplus nor a shortage.</dd>
<dt>Clearing service (clearinghouse)</dt><dd>intermediary between buyers and sellers in a commodity transaction.
Process of settling trades, managing risk, and guaranteeing the performance of buyers and sellers in a
commodity transaction. Types:
<ul class="org-ul">
<li>Exchange-based clearing: Provided by exchanges, such as the Chicago Mercantile Exchange (CME) or the
Intercontinental Exchange (ICE), which offer clearing services for trades executed on their platforms.</li>
<li>Over-the-counter (OTC) clearing: Provided by third-party clearinghouses, such as the London Clearing House
(LCH) or the Depository Trust &amp; Clearing Corporation (DTCC), which clear trades executed outside of
formal exchanges, directly with each other.</li>
</ul></dd>
<dt>Spot price</dt><dd>cash price or current price -  for immediate (or short 1-2 days) delivery.
<dl class="org-dl">
<dt>Delivery date</dt><dd>Spot prices are for immediate delivery, while futures prices are for delivery at a
specific future date.</dd>
<dt>Price risk</dt><dd>Spot prices reflect current market conditions and are subject to immediate price risk, while
futures prices are locked in at the time of the contract and are subject to price risk at the time of
delivery.</dd>
<dt>Liquidity</dt><dd>Spot markets are generally more liquid than futures markets, meaning it's easier to buy or
sell assets at the current market price.</dd>
</dl></dd>
<dt>Futures price</dt><dd>a future date after delivery.</dd>
<dt>Commodity price index</dt><dd>index for some commodity, may be may be based on spot or futures prices.</dd>
<dt>Commodity index fund</dt><dd>fund whose assets are invested in financial instruments based on or linked to a
commodity index.</dd>
<dt>Cash commodity</dt><dd>not derivatives, commodities that someone is buying/selling/trading.</dd>
<dt>Derivatives</dt><dd>evolved from simple commodity future contracts to many others.</dd>
<dt>Exchage</dt><dd>organized market</dd>
<dt>Premises</dt><dd>warehouse</dd>
<dt>Metric tonne</dt><dd>weight of oil and other petroleum products. 1 = 1,000 kilograms or 2,204.62 pounds</dd>
<dt>petroleum products</dt><dd>нефтепродукты</dd>
<dt>FOB</dt><dd>Most oil is sold either FOB (effectively priced at the loading port) or CIF (effectively priced at
the delivery port). Exclude all insurance and freight charges.</dd>
<dt>MT</dt><dd>metric tons is a lot size</dd>
<dt>kgs</dt><dd>kilograms</dd>
<dt>bbl</dt><dd>barrels</dd>
<dt>Lots</dt><dd>number of units of a financial unstrument traded in one transactions. Lot - size of transaction</dd>
<dt>price quote</dt><dd>катеровка цены, ценовое предложение, latest price. Quoted price is only valid for a certain
period of time.</dd>
<dt>Spread</dt><dd>is defined as the difference between the current bid and ask prices</dd>
<dt>contingencies</dt><dd>непредвиденные обстоятельства</dd>
<dt>Clearing Broker</dt><dd></dd>

<dt>Executing Broker</dt><dd>execute buy/sell orders on behalf of clients. They find the best prices in the market.</dd>
<dt>Clearing Broker</dt><dd>settlement of trades after they have been executed. Ensure that transaction is completed,
includes transferring ownership of the securities and handling the associated cash flows.</dd>
<dt>Financial statement</dt><dd>formal records of fin. activities.
<dl class="org-dl">
<dt>Consolided FS</dt><dd>FS of a grpup in which the assets, liabilities, equality, income, expenses and cash flows
of the parent company and it's subsidiaries are presented as of a single econimic entity. Type of report.</dd>
</dl></dd>
<dt>revenue, income, profits</dt><dd>something similar.</dd>
<dt>income statement or profit and loss account</dt><dd>one of financial statement of a company. Net income, result after all revenues and expenses have been accounted for.</dd>
<dt>PnL</dt><dd>day-over-day change in the value of a portfolio (value today - value prior day)</dd>
<dt>(no term)</dt><dd></dd>
</dl>

<p>
links
</p>
<ul class="org-ul">
<li><a href="https://imperiumcs.com/commodity-markets-glossary-terms/">https://imperiumcs.com/commodity-markets-glossary-terms/</a></li>
<li><a href="https://www.commoditiesdemystified.info/en/glossary">https://www.commoditiesdemystified.info/en/glossary</a></li>
<li><a href="https://www.unitedfutures.com/glossary.htm">https://www.unitedfutures.com/glossary.htm</a></li>
</ul>
</div>
</div>
<div id="outline-container-org232101d" class="outline-3">
<h3 id="org232101d"><span class="section-number-3">2.2.</span> free books</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The Basics of Commodities Trading
</p>

<p>
CME Commodity Trading Manual 2006 <a href="file:///home/ff/Downloads/ChickMan.pdf">file:///home/ff/Downloads/ChickMan.pdf</a> <a href="https://www.le.ac.uk/users/dsgp1/COURSES/DERIVATE/RESOURCE/ChickMan.pdf">https://www.le.ac.uk/users/dsgp1/COURSES/DERIVATE/RESOURCE/ChickMan.pdf</a>
</p>

<p>
Commodities trading: Commodities Trading 101: Lessons from Trading Books <a href="https://fastercapital.com/content/Commodities-trading--Commodities-Trading-101--Lessons-from-Trading-Books.html">https://fastercapital.com/content/Commodities-trading--Commodities-Trading-101--Lessons-from-Trading-Books.html</a>
</p>
</div>
</div>
<div id="outline-container-org980ab21" class="outline-3">
<h3 id="org980ab21"><span class="section-number-3">2.3.</span> theory</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org4cbc74c" class="outline-4">
<h4 id="org4cbc74c"><span class="section-number-4">2.3.1.</span> differences:</h4>
<div class="outline-text-4" id="text-2-3-1">
<dl class="org-dl">
<dt>Elasitcity</dt><dd>Electricity(low) vs Gold(high) - said: “elastic demand”. Refers to how responsive the demand for a
commodity is to changes in its price. Commodities with low elasticity have a stable demand, regardless of
price fluctuations, while those with high elasticity have a demand that can change significantly with price
changes.</dd>
<dt>Deliverability</dt><dd>Natural gas (high) vs Lean hogs (low) - how ease and speed with which a commodity can be
transported and delivered to various markets.</dd>
<dt>Substitability</dt><dd>Coffee (high) vs Gasoline (low) - can be replaced by other products or
alternatives. Commodities with high substitutability have many alternatives, making demand more responsive
to price changes, while those with low substitutability have limited alternatives, making demand less
responsive.</dd>
<dt>Storability</dt><dd>Animals (low) vs Aluminum (high) - stored for extended periods without significant degradation or loss of
value. Commodities with high storability can be kept in inventory for long periods, while those with low
storability require immediate use or processing.</dd>
<dt>Exchange Prices vs Local Prices</dt><dd>Natural gas at Henry Hub (stable) vs Natural gas at source (local
variable)</dd>
<dt>Timing vs Production</dt><dd>Winter wheat (low sensitive to weather) vs Spring wheat (high sensisitve) - seasonal
patterns of a commodity, some commodities have specific timing requirements, such as planting and harvesting
seasons, which can affect their yield and availability.</dd>
</dl>
</div>
</div>
