aspect.html

<div id="outline-container-orgc835252" class="outline-4">
<h4 id="orgc835252"><span class="section-number-4">2.3.2.</span> Cash, Forward, futures, options</h4>
<div class="outline-text-4" id="text-2-3-2">
<dl class="org-dl">
<dt>Cash sales</dt><dd>deliver to offline market and sell with the price for the day.</dd>
<dt>Forward contracts</dt><dd>P2P, Contract not standardized. Negotiated now for delivery later for specified price
at the time of delivery. You are protected if prices fall.</dd>
<dt>Futures contracts</dt><dd>P2B. Contract standardized. (like forward) agreement to buy or sell a commodity at a
date in the future. Buy or sell throught a brokerage firm that transacts the trade for you. You must deposit
a “performance bound” (a small percentage of the contract value). <b>Specifies everythin but the price.</b></dd>
<dt>options on futures contracs</dt><dd>P2P</dd>
<dt>Option</dt><dd>P2P, buyer purchases the right but not the obligation to buy an agreed quantity of a
particular commodity or financial instrument (the underlying) from the seller of the option at a certain
time (the expiration date) for a certain price (the strike price). The seller (or "writer") is obligated to
sell the commodity or financial instrument should the buyer so decide. The buyer pays a fee (called a
premium) for this right.
<dl class="org-dl">
<dt>call option (to buy something at price)</dt><dd>The holder of a call option hopes that the price of the
underlying asset will rise above the strike price, allowing them to buy the asset at the lower strike
price and sell it at the higher market price later.</dd>
<dt>put option (to sell something at price)</dt><dd>gives the holder the right to sell an underlying asset at a predetermined price, known as
the strike price. The holder of a put option hopes that the price of the underlying asset will fall below
the strike price, allowing them to sell the asset at the higher strike price and buy it back at the lower
market price later.</dd>
</dl></dd>
</dl>

<p>
“sell forward contracts” - I get agreement to sell a commodity or asset at a future date, at a predetermined
 price.
</p>
</div>
</div>
<div id="outline-container-orga756935" class="outline-4">
<h4 id="orga756935"><span class="section-number-4">2.3.3.</span> other contracts</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ol class="org-ol">
<li><a id="org5762b00"></a>swap<br />
<div class="outline-text-5" id="text-2-3-3-1">
<p>
derivative contract, s exchanging one type of cash flow for another. In commodity trading, swaps are
 used to hedge against price risks or to speculate on price movements.
</p>


<p>
Ex. Suppose a farmer wants to hedge against a potential decline in the price of wheat. They enter into a swap
 contract with a bank, agreeing to exchange a fixed price of $200 per ton of wheat for a floating price based
 on the market price of wheat. If the market price of wheat falls to $180 per ton, the farmer will receive $20
 per ton from the bank, which will help offset the loss in revenue. Types of swaps:
</p>

<p>
Types
</p>
<ul class="org-ul">
<li>Fixed-for-floating swap: Exchanges a fixed price for a floating price.</li>
<li>Floating-for-floating swap: Exchanges one floating price for another floating price.</li>
<li>Basis swap: Exchanges a fixed price for a floating price, with the floating price based on a specific
market index.</li>
</ul>
</div>
</li>
<li><a id="orgeedabfa"></a><span class="todo TODO">TODO</span> Exchange-traded commodities (ETCs)<br /></li>
</ol>
</div>

<div id="outline-container-org7d04e46" class="outline-4">
<h4 id="org7d04e46"><span class="section-number-4">2.3.4.</span> <b>Hedging</b></h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
(minimise or remove price risk) - by taking an opposite position in the futures market.
</p>

<p>
Example: Suppose you have a forward contract to sell 1,000 barrels of oil at $50 per barrel in three
 months. To hedge this position, you could:
</p>

<ul class="org-ul">
<li>Buy a futures contract: Buy a futures contract for 1,000 barrels of oil at $50 per barrel, expiring in three
months. This would offset the risk of the forward contract.</li>
<li>Buy a call option: Buy a call option to buy 1,000 barrels of oil at $50 per barrel, expiring in three
months. This would give you the right, but not the obligation, to buy oil at $50 per barrel, reducing the
risk of the forward contract.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd8e99f7" class="outline-4">
<h4 id="orgd8e99f7"><span class="section-number-4">2.3.5.</span> categories</h4>
<div class="outline-text-4" id="text-2-3-5">
<ul class="org-ul">
<li>Energy (such as Coal, Crude Oil, Ethanol, Gas Oil, Gasoline, Heating Oil, Natural Gas, Propane)</li>
<li>Metals
<ul class="org-ul">
<li>Base metals (such as Lead, Zinc, Nickel, Copper)</li>
<li>Precious metals (such as Gold, Silver, Platinum, Palladium)</li>
</ul></li>
<li>Agriculture
<ul class="org-ul">
<li>Grains (such as Corn, Oats, Rice, Soybeans, Wheat)</li>
<li>Softs (such as Coffee, Cocoa, Sugar, Butter, Cotton, Milk, Orange Juice)</li>
<li>Livestock (such as Hogs, Live Cattle, Pork Bellies, Feeder Cattle)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org49748ac" class="outline-4">
<h4 id="org49748ac"><span class="section-number-4">2.3.6.</span> open interest and Bull/Bear market</h4>
<div class="outline-text-4" id="text-2-3-6">
<p>
<b>Open interest</b> is a number of contracts outstanding at the end of each day. this number changes from day to day
 and gives us trand.
</p>

<p>
<b>Bull</b> One who expect prices to rise
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Prices</th>
<th scope="col" class="org-left">Volume</th>
<th scope="col" class="org-left">Open interest</th>
<th scope="col" class="org-left">Market Direction</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Rising</td>
<td class="org-left">Rising</td>
<td class="org-left">Rising</td>
<td class="org-left">Bullish</td>
</tr>

<tr>
<td class="org-left">Rising</td>
<td class="org-left">Falling</td>
<td class="org-left">Falling</td>
<td class="org-left">Bearish</td>
</tr>

<tr>
<td class="org-left">Falling</td>
<td class="org-left">Rising</td>
<td class="org-left">Rising</td>
<td class="org-left">Bearish</td>
</tr>

<tr>
<td class="org-left">Falling</td>
<td class="org-left">Falling</td>
<td class="org-left">Falling</td>
<td class="org-left">Bullish</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org6018fa1" class="outline-3">
<h3 id="org6018fa1"><span class="section-number-3">2.4.</span> todo</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Define commodities and their key features
Identify the major commodity categories
Discuss the drivers of the commodities in different categories
Undertake commodity trading strategies using futures and options
Explain commodity spreads and common spread trading strategies
</p>
</div>
</div>

<div id="outline-container-org75d6a81" class="outline-3">
<h3 id="org75d6a81"><span class="section-number-3">2.5.</span> trading process</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>Trade matching: Verifying that the trade details, such as price, quantity, and delivery terms, match between the buyer and seller.</li>
<li>Trade confirmation: Confirming the trade details with both parties to ensure accuracy and agreement.</li>
<li>Margining: Collecting and managing margin deposits from traders to cover potential losses.</li>
<li>Risk management: Monitoring and managing the risk of default by either party, using techniques such as position limits, stop-loss orders, and margin calls.</li>
<li>Settlement: Facilitating the exchange of commodities and payment between buyers and sellers, ensuring that the transaction is completed smoothly and efficiently.</li>
<li>Guaranteeing performance: Acting as a guarantor for the trade, ensuring that the buyer and seller fulfill their obligations.</li>
</ul>
</div>
</div>
<div id="outline-container-orge227493" class="outline-3">
<h3 id="orge227493"><span class="section-number-3">2.6.</span> clearing services</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Clearing services offer several benefits to commodity traders, including:
</p>
<ul class="org-ul">
<li>Reduced counterparty risk: By acting as a guarantor, clearing services minimize the risk of default by either party.</li>
<li>Increased efficiency: Clearing services streamline the trading process, reducing the time and effort required to settle trades.</li>
<li>Improved transparency: Clearing services provide a transparent and auditable record of trades, helping to
prevent errors and disputes.</li>
<li>Enhanced risk management: Clearing services help traders manage their risk exposure, using techniques such
as margining and position limits.</li>
</ul>
</div>
