aspect.html

<div id="outline-container-org2260878" class="outline-4">
<h4 id="org2260878"><span class="section-number-4">2.6.1.</span> notable clearing services, electronic exchanges:</h4>
<div class="outline-text-4" id="text-2-6-1">
<ul class="org-ul">
<li>CME Clearing: (largest in the world) Provided by the Chicago Mercantile Exchange (CME), one of the largest
and most well-established clearinghouses in the world.
<ul class="org-ul">
<li>CBOT - It is a subsidiary of the CME Group, focuses on agricultural commodities.</li>
</ul></li>
<li>ICE Clear: Provided by the Intercontinental Exchange (ICE), which offers clearing services for a range of
commodity and financial markets.</li>
<li>LCH.Clearnet: A leading independent clearinghouse, which provides clearing services for a range of markets,
including commodities, currencies, and interest rates.</li>
<li>DTCC: The Depository Trust &amp; Clearing Corporation, which provides clearing and settlement services for a
range of financial markets, including commodities.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6c5bdd7" class="outline-3">
<h3 id="org6c5bdd7"><span class="section-number-3">2.7.</span> Resources</h3>
<div class="outline-text-3" id="text-2-7">
<dl class="org-dl">
<dt>CME Group</dt><dd><a href="https://www.cmegroup.com">https://www.cmegroup.com</a> derivatives exchanges - trading in futures and options + real-time data</dd>
<dt>ICE (Intercontinental Exchange)</dt><dd><a href="https://www.ice.com">https://www.ice.com</a> Clearing + trading and clearing services + real-time data</dd>

<dt>Bloomberg</dt><dd>real-time data <a href="https://www.bloomberg.com">https://www.bloomberg.com</a></dd>
<dt>Thomson Reuters Eikon</dt><dd>real-time data  <a href="https://www.thomsonreuters.com/en/products-services/financial-markets/trading-platforms/eikon.html">https://www.thomsonreuters.com/en/products-services/financial-markets/trading-platforms/eikon.html</a></dd>
<dt>(no term)</dt><dd>S&amp;P Global have: ratings, Market Intelligence, Dow Jones Indices, Engineering Solutions, Capital IQ
<dl class="org-dl">
<dt>S&amp;P Global Commodity Insights</dt><dd><a href="https://www.spglobal.com/commodityinsights">https://www.spglobal.com/commodityinsights</a> real-time data + most used for analysis</dd>
<dt>Platts</dt><dd><a href="https://www.spglobal.com/platts">https://www.spglobal.com/platts</a> real-time data for  energy and commodities market.</dd>
</dl></dd>
<dt>Argus Media</dt><dd><a href="https://www.argusmedia.com">https://www.argusmedia.com</a> : real-time data</dd>
<dt>Refinitiv</dt><dd><a href="https://www.refinitiv.com">https://www.refinitiv.com</a> - real-time data and analytics</dd>
<dt>(no term)</dt><dd>Cargill: <a href="https://www.cargill.com/">https://www.cargill.com/</a> - agro-commodity trader and processor + real-time data</dd>
<dt>(no term)</dt><dd>World Bank and IMF Reports: offer research and reports on global economic trends, including commodity
markets, which can be valuable for risk assessment.</dd>
<dt>(no term)</dt><dd>Trade Associations: Organizations like the International Energy Agency (IEA) and the American Petroleum
Institute (API) provide industry reports and statistics that are useful for understanding market dynamics.</dd>
<dt>(no term)</dt><dd>News and Research Websites:
<ul class="org-ul">
<li>Seeking Alpha: Offers insights and analysis on various commodities and markets.</li>
<li>MarketWatch: Provides news, analysis, and data on commodities and financial markets.</li>
<li>Investing.com: Offers data, news, and analysis for various commodities, including real-time price updates.</li>
</ul></dd>
<dt>(no term)</dt><dd>Academic Journals and Publications: Research published in journals such as the "Journal of Commodity
Markets" and the "Energy Journal" can provide valuable insights into commodity pricing, trading
strategies, and risk management.</dd>
<dt>(no term)</dt><dd>Social Media and Networking Platforms: LinkedIn and Twitter can be useful for following industry experts,
analysts, and news outlets for real-time updates and insights.</dd>
</dl>

<p>
News and Research Websites
</p>
<ul class="org-ul">
<li>Bloomberg: www.bloomberg.com - news and analysis</li>
<li>Reuters: www.reuters.com - news and analysis</li>
<li>CNBC: www.cnbc.com - news and analysis</li>
<li>Seeking Alpha: www.seekingalpha.com - news and analysis</li>
<li>Investing.com: www.investing.com - news and analysis</li>
</ul>


<p>
Regulatory and Industry Organizations
</p>
<ul class="org-ul">
<li>CFTC (Commodity Futures Trading Commission): www.cftc.gov - regulatory agency</li>
<li>SEC (Securities and Exchange Commission): www.sec.gov - regulatory agency</li>
<li>ICE (Intercontinental Exchange): www.theice.com - industry organization</li>
<li>CME Group: www.cmegroup.com - industry organization</li>
<li>National Futures Association: www.nfa.futures.org - industry organization</li>
</ul>

<p>
CME Group, ICE, and Refinitiv.
</p>
</div>
</div>
<div id="outline-container-org0a532dd" class="outline-3">
<h3 id="org0a532dd"><span class="section-number-3">2.8.</span> Exchanges or Exchange Traded Commodities.</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<a href="https://en.wikipedia.org/wiki/Commodity_trading#Commodities_exchange">https://en.wikipedia.org/wiki/Commodity_trading#Commodities_exchange</a>
<a href="https://en.wikipedia.org/wiki/Commodities_exchange">https://en.wikipedia.org/wiki/Commodities_exchange</a>
</p>

<p>
Most ETCs implement a futures trading strategy.
</p>

<ul class="org-ul">
<li>ICE Futures Europe (IFEU)
<ul class="org-ul">
<li>Electronic trading platform</li>
<li>Clearing and settlement</li>
<li>Market data</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org319f563" class="outline-3">
<h3 id="org319f563"><span class="section-number-3">2.9.</span> INCOTERMS</h3>
<div class="outline-text-3" id="text-2-9">
<p>
is a set of standardized terms used in international trade. developed by the International Chamber of Commerce
 (ICC).
</p>

<p>
Categories
</p>
<ul class="org-ul">
<li>E-terms: These terms (EXW, FCA, FAS, FOB) refer to the seller's obligations and responsibilities.</li>
<li>C-terms: These terms (CFR, CIF, CPT, CIP) refer to the buyer's obligations and responsibilities.</li>
<li>D-terms: These terms (DAT, DAP, DDP) refer to the delivery of goods to a specific location.</li>
</ul>

<p>
Common INCOTERMS:
</p>
<dl class="org-dl">
<dt>FOB (Free on Board)</dt><dd>The seller is responsible for delivering the goods to the buyer's ship, and the buyer
is responsible for the costs and risks of transportation.</dd>
<dt>CIF (Cost, Insurance, and Freight)</dt><dd>The seller is responsible for delivering the goods to the buyer's
destination, including the costs of transportation and insurance.</dd>
<dt>CFR (Cost and Freight)</dt><dd>The seller is responsible for delivering the goods to the buyer's destination,
including the costs of transportation, but not insurance.</dd>
<dt>EXW (Ex Works)</dt><dd>The seller is responsible for making the goods available at their premises, and the buyer is
responsible for the costs and risks of transportation.</dd>
</dl>
</div>
</div>

<div id="outline-container-org3873a46" class="outline-3">
<h3 id="org3873a46"><span class="section-number-3">2.10.</span> courses</h3>
<div class="outline-text-3" id="text-2-10">
<p>
<a href="https://corporatefinanceinstitute.com/course/commodities-fundamentals/">https://corporatefinanceinstitute.com/course/commodities-fundamentals/</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
